In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Visadataset.csv')
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [4]:
df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [ ]:
data = df.to_dict(orient='records')
data

In [2]:
DB_NAME = 'US_VISA'

COLLECTION_NAME= "visa_data"

CONNECTION_URL = "mongodb+srv://bharath:bharath@datascience.gtwwosz.mongodb.net/?retryWrites=true&w=majority"

In [3]:
import pymongo

client = pymongo.MongoClient(CONNECTION_URL)

data_base = client[DB_NAME]

collection = data_base[COLLECTION_NAME]

# rec = collection.insert_many(data)

In [4]:
collection

Collection(Database(MongoClient(host=['ac-fc17dhq-shard-00-00.gtwwosz.mongodb.net:27017', 'ac-fc17dhq-shard-00-02.gtwwosz.mongodb.net:27017', 'ac-fc17dhq-shard-00-01.gtwwosz.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, retrywrites=True, w='majority', authsource='admin', replicaset='atlas-3dfw1j-shard-0', tls=True), 'US_VISA'), 'visa_data')

In [ ]:
records = collection.find()

for i, j in enumerate(records):
    print(f"{i}: {j}")

In [6]:
df = pd.DataFrame(list(collection.find()))

In [7]:
df.head()

,_id,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,63ca48ed9cca09817bd83c61,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,63ca48ed9cca09817bd83c62,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,63ca48ed9cca09817bd83c63,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,63ca48ed9cca09817bd83c64,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,63ca48ed9cca09817bd83c65,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [8]:
df.shape

(25480, 13)

In [9]:
if "_id" in df.columns.to_list():
    df = df.drop(columns=["_id"], axis=1)

In [10]:
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [11]:
df.shape

(25480, 12)